#include "iwdg.h"


/*******************************************************************************************************
** 函数: IWDG_Init，初始化独立看门狗
**------------------------------------------------------------------------------------------------------
** 参数: pre:分频数:0~7(只有低3位有效!)   rlr:重装载寄存器值:低11位有效.
** 返回: 无
** 说明:分频因子=4*2^prer.但最大值只能是256!  时间计算(大概):Tout=((4*2^prer)*rlr)/40 (ms).
********************************************************************************************************/
void IWDG_Init(u8 sec) 
{	
 	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);  //使能对寄存器IWDG_PR和IWDG_RLR的写操作
	
	IWDG_SetPrescaler(64);  //设置IWDG预分频值:设置IWDG预分频值为64
	
	IWDG_SetReload(sec*625);  	 //设置IWDG重装载值
	
	IWDG_ReloadCounter();  	 //按照IWDG重装载寄存器的值重装载IWDG计数器
	
	IWDG_Enable();  		 //使能IWDG
}

/*******************************************************************************************************
** 函数: IWDG_Feed，喂独立看门狗
**------------------------------------------------------------------------------------------------------
** 参数: void
** 返回: 无
********************************************************************************************************/
void IWDG_Feed(void)
{   
 	IWDG_ReloadCounter();//reload										   
}
