#include "SysTick.h"

static uint8  fac_us = 0;  // us延时倍乘数		
static uint16 fac_ms = 0;  // ms延时倍乘数

/********************************************************************************************************
** 函数: SysTick_Init, 滴答定时器初始化，SYSTICK的时钟固定为AHB时钟的1/8
**------------------------------------------------------------------------------------------------------
** 参数: SYSCLK(系统时钟频率)
** 返回: 无	
********************************************************************************************************/
void SysTick_Init(uint8 SYSCLK)
{
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);
	fac_us = SYSCLK / 8;
	fac_ms = (uint16)fac_us * 1000;
}

/********************************************************************************************************
** 函数: delay_us,  微秒级延时
**------------------------------------------------------------------------------------------------------
** 参数: nus
** 返回: 无	
********************************************************************************************************/
void delay_us(uint32 nus)
{
	uint32 temp;
	
	SysTick -> LOAD  = nus*fac_us;				// 时间加载
	SysTick -> VAL   = 0x00;					// 清空计数器
	SysTick -> CTRL |= SysTick_CTRL_ENABLE_Msk; // 开始递减计数
	do
	{
		temp = SysTick -> CTRL;
	}while((temp&0x01)&&!(temp&(1<<16)));		// 等待时间到达
	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;  // 关闭计数器
	SysTick->VAL   = 0X00; 						// 清空计数器
}

/********************************************************************************************************
** 函数: delay_ms,  毫秒级延时
**------------------------------------------------------------------------------------------------------
** 参数: nms
** 返回: 无	
** 注意: SysTick->LOAD为24位寄存器,所以,nms<=0xffffff*8*1000/SYSCLK,对72M条件下,nms<=1864 
********************************************************************************************************/
void delay_ms(uint16 nms)
{
	uint32 temp;	
	
	SysTick -> LOAD  = (uint32)nms*fac_ms;		//时间加载(SysTick->LOAD为24bit)
	SysTick -> VAL   = 0x00;					//清空计数器
	SysTick -> CTRL |= SysTick_CTRL_ENABLE_Msk;	//开始倒数  
	do
	{
		temp = SysTick -> CTRL;
	}while((temp&0x01)&&!(temp&(1<<16)));		//等待时间到达   
	SysTick -> CTRL &= ~SysTick_CTRL_ENABLE_Msk;//关闭计数器
	SysTick -> VAL   = 0X00;       				//清空计数器	  
}

/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
